app/controllers/directory_controller.rb

  def index
    @categories = Hash.new
    Category.all.each do |category|
      @categories[category.name] = category.users.select(:rank, :full_name)
---
SELECT "categories".* FROM "categories"
SELECT "users"."rank", "users"."full_name" FROM "users" WHERE "users"."category_id" = $1  [["category_id", 1]]