app/controllers/office_bearers_controller.rb

SELECT "positions".* FROM "positions"
SELECT "users"."full_name" FROM "users" WHERE "users"."position_id" = $1  [["position_id", 1]]
---
  def index
    @positions = Hash.new
    Position.all.each do |position|
      @positions[position.title] = position.users.select(:full_name)