app/controllers/subscriptions_controller.rb

  def index
    now = DateTime.now
    this_year = now.beginning_of_year..now
    # User has not made any payments or has not paid this year
    @defaulters = User.includes(:payments).where(payments: {user_id: nil})
                      .or(User.includes(:payments).where.not(payments: {date: this_year}))
---
SELECT DISTINCT COUNT(DISTINCT "users"."id") FROM "users" LEFT OUTER JOIN "payments" ON "payments"."user_id" = "users"."id" WHERE (NOT ("payments"."date" BETWEEN $1 AND $2)) AND ("payments"."user_id" != $3)  [["date", 2016-12-31 18:30:00 UTC], ["date", 2017-06-05 06:35:00 UTC], ["user_id", 1]]